Revit 2026 API

# LabelUtilsGetLabelForDiscipline Method

---

Gets the user-visible name for a discipline.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetLabelForDiscipline(
	ForgeTypeId disciplineTypeId
)
```
```vb
Public Shared Function GetLabelForDiscipline (
	disciplineTypeId As ForgeTypeId
) As String
```
```cpp
public:
static String^ GetLabelForDiscipline(
	ForgeTypeId^ disciplineTypeId
)
```
```fsharp
static member GetLabelForDiscipline :
        disciplineTypeId : ForgeTypeId -> string
```

#### Parameters

disciplineTypeId ForgeTypeId
     Identifier of the discipline.

#### Return Value

String Returns the user-visible name for a discipline.

| Exception | Condition |
| --- | --- |
| ArgumentException | Discipline must have a definition. |
| ArgumentNullException | A non-optional argument was null |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

Autodesk.Revit.DB Namespace